### patient detail

In [1]:
import pandas as pd
import numpy as np

In [2]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [3]:
x1=np.random.randint(1,50,10)
print("x1= ",x1)

x1=  [46 25 12  8  6 36 43  1 23  8]

In [4]:
p1=np.random.randint(25,100,5)
p2=np.random.randint(25,100,5)
p3=np.random.randint(25,100,5)
p4=np.random.randint(25,100,5)
p5=np.random.randint(25,100,5)

In [5]:
ds1=pd.DataFrame({"person_1":p1,"person_2":p2,"person_3":p3,"person_4":p4,"person_5":p5},index=["tamil","eng","math","science","social"])

In [6]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          29        83        68        96        78
eng            77        55        65        33        45
math           58        97        65        36        63
science        47        27        68        63        75
social         44        82        68        85        74

In [7]:
ds1["person_2"]

tamil      83
eng        55
math       97
science    27
social     82
Name: person_2, dtype: int64

In [8]:
ds1["person_2"].sum()

344

In [9]:
ds1["person_2"][3]=41

In [10]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          29        83        68        96        78
eng            77        55        65        33        45
math           58        97        65        36        63
science        47        41        68        63        75
social         44        82        68        85        74

In [11]:
ds1[ds1<35]

         person_1  person_2  person_3  person_4  person_5
tamil        29.0       NaN       NaN       NaN       NaN
eng           NaN       NaN       NaN      33.0       NaN
math          NaN       NaN       NaN       NaN       NaN
science       NaN       NaN       NaN       NaN       NaN
social        NaN       NaN       NaN       NaN       NaN

In [12]:
# ds1.idxmax()
ds1[ds1<35]=40

In [13]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          40        83        68        96        78
eng            77        55        65        40        45
math           58        97        65        36        63
science        47        41        68        63        75
social         44        82        68        85        74

In [14]:
ds1.idxmin()

person_1      tamil
person_2    science
person_3        eng
person_4       math
person_5        eng
dtype: object

In [15]:
me=ds1.mean().T

In [16]:
ds1.loc["mean"]=me

In [17]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil        40.0      83.0      68.0      96.0      78.0
eng          77.0      55.0      65.0      40.0      45.0
math         58.0      97.0      65.0      36.0      63.0
science      47.0      41.0      68.0      63.0      75.0
social       44.0      82.0      68.0      85.0      74.0
mean         53.2      71.6      66.8      64.0      67.0

In [18]:
ds1.rank()

         person_1  person_2  person_3  person_4  person_5
tamil         1.0       5.0       5.0       6.0       6.0
eng           6.0       2.0       1.5       2.0       1.0
math          5.0       6.0       1.5       1.0       2.0
science       3.0       1.0       5.0       3.0       5.0
social        2.0       4.0       5.0       5.0       4.0
mean          4.0       3.0       3.0       4.0       3.0

In [19]:
import requests as rq

In [20]:
header={
    "User-Agent":"Mozilla/5.0(x11;Linux x86_64)AppleWebkit/537.36(KHTML,like Gecko)chrome/50.2667.75 Safari/537.36",
    "x_requested-with":"XMLHttp request"
}

In [28]:
wd=rq.get("https://spaceweather.com/",headers=header)

In [29]:
wd

In [30]:
wd=pd.read_html(wd.text)

In [31]:
wd

[                                                   0  \
 0                                                NaN
 1                                                NaN
 2                                                NaN
 3  Solar wind  speed: 358.5 km/sec  density: 1.81...

                                1
 0       All Sky Fireball Network
 1                            NaN
 2  Cosmic Rays in the Atmosphere
 3                            NaN  ,
     0   1   2   3   4
 0 NaN NaN NaN NaN NaN
 1 NaN NaN NaN NaN NaN
 2 NaN NaN NaN NaN NaN
 3 NaN NaN NaN NaN NaN
 4 NaN NaN NaN NaN NaN,
                                                    0  \
 0                                                NaN
 1                                                NaN
 2                                                NaN
 3  Solar wind  speed: 358.5 km/sec  density: 1.81...

                                                    1  \
 0                           All Sky Fireball Network
 1                                                NaN
 2                      Cosmic Rays in the Atmosphere
 3  Friday, May. 24, 2024  What's up in space This...

                                                    2
 0                                                NaN
 1                                                NaN
 2                                                NaN
 3  Morocco Tours: Unleash your inner adventurer! ...  ,
                                                    0
 0  Solar wind  speed: 358.5 km/sec  density: 1.81...,
     0                                                  1   2
 0 NaN  Solar wind  speed: 358.5 km/sec  density: 1.81... NaN,
                                0   1
 0  SPACE WEATHER  NOAA Forecasts NaN,
          0         1          2
 0    FLARE  0-24  hr  24-48  hr
 1  CLASS M      60 %       60 %
 2  CLASS X      10 %       10 %,
         0         1          2
 0     NaN  0-24  hr  24-48  hr
 1  ACTIVE      30 %       25 %
 2   MINOR      10 %       10 %
 3  SEVERE      01 %       01 %,
         0         1          2
 0     NaN  0-24  hr  24-48  hr
 1  ACTIVE      15 %       15 %
 2   MINOR      25 %       25 %
 3  SEVERE      40 %       35 %,
                                                    0  \
 0                                                NaN
 1                                                NaN
 2                                                NaN
 3          Friday, May. 24, 2024  What's up in space
 4  This is an AI Free Zone! Text created by Large...

                                1
 0       All Sky Fireball Network
 1                            NaN
 2  Cosmic Rays in the Atmosphere
 3                            NaN
 4                            NaN  ,
     0                   1                      2   3   4
 0 NaN                 NaN                    NaN NaN NaN
 1 NaN                 NaN  Friday, May. 24, 2024 NaN NaN
 2 NaN  What's up in space  Friday, May. 24, 2024 NaN NaN,
     0                                                  1   2   3
 0 NaN                           All Sky Fireball Network NaN NaN
 1 NaN                                                NaN NaN NaN
 2 NaN                      Cosmic Rays in the Atmosphere NaN NaN
 3 NaN                                                NaN NaN NaN
 4 NaN  This is an AI Free Zone! Text created by Large... NaN NaN
 5 NaN                                                NaN NaN NaN,
                                                    0   1   2
 0  This is an AI Free Zone! Text created by Large... NaN NaN,
     0                         1
 0 NaN  All Sky Fireball Network,
     0                     1
 0 NaN  Near Earth Asteroids,
             0                              1              2                3  \
 0         NaN  Cosmic Rays in the Atmosphere            NaN              NaN
 1    Asteroid                       Date(UT)  Miss Distance  Velocity (km/s)
 2    2024 JQ1                    2024-May-18         5.7 LD                3
 3    2024 JK8                    2024-May-19           6 LD              9.8
 4    2024 JD1                    2024-May-20          19 LD              5.5
 5    2015 WO1                    2024-May-20         7.4 LD             15.6
 6   2024 JP12                    2024-May-21          11 LD              6.3
 7   2024 JZ17                    2024-May-21         6.6 LD             10.3
 8     2024 KC                    2024-May-21         4.3 LD              4.6
 9    2019 VB5                    2024-May-21         7.8 LD              6.3
 10  2024 JG15                    2024-May-22         6.6 LD             10.8
 11   2024 JZ6                    2024-May-23        14.6 LD             13.8
 12    2024 HP                    2024-May-23        15.5 LD              7.7
 13  2024 JX14                    2024-May-23        16.4 LD              6.2
 14   2024 HP2                    2024-May-25         5.8 LD              2.3
 15   2024 JY1                    2024-May-26        17.5 LD             10.3
 16  2024 JO16                    2024-May-27           8 LD              8.8
 17    2008 LD                    2024-May-28         7.7 LD              4.5
 18  2024 JV17                    2024-May-28        17.3 LD              8.4
 19    2021 LV                    2024-May-29          12 LD             15.5
 20    2024 JG                    2024-May-29         8.7 LD              7.4
 21   2024 JA3                    2024-May-30         6.2 LD              8.5
 22    2008 XH                    2024-May-31        13.8 LD             14.7
 23   2024 JP1                    2024-Jun-01        18.5 LD              4.7
 24   2024 JC1                    2024-Jun-01        15.1 LD              4.8
 25  1998 KY26                    2024-Jun-01          12 LD              5.3
 26   2016 JC6                    2024-Jun-01        19.9 LD              7.1
 27  2024 JR17                    2024-Jun-05        19.4 LD             14.6
 28   2008 YN2                    2024-Jun-05        10.5 LD              7.7
 29   2021 LW3                    2024-Jun-06         9.7 LD              9.8
 30   2024 CR9                    2024-Jun-11        19.2 LD              7.4
 31   2022 XC1                    2024-Jun-12        16.5 LD              6.5
 32  2022 WW11                    2024-Jun-17        19.7 LD             14.4
 33    2019 NJ                    2024-Jun-27        17.2 LD             10.1
 34     415029                    2024-Jun-27        17.3 LD             25.9
 35   2022 MM1                    2024-Jun-28         7.8 LD             10.9
 36    2010 XN                    2024-Jun-28        14.1 LD             11.3
 37   2022 HD1                    2024-Jun-29        17.3 LD              7.2
 38   2017 MB3                    2024-Jun-30           5 LD              6.5
 39  2022 BY39                    2024-Jul-02        13.2 LD                3
 40   2022 YS5                    2024-Jul-11          11 LD              5.8
 41  2024 BY15                    2024-Jul-16        16.2 LD              0.7
 42        NaN                            NaN            NaN              NaN

                4
 0            NaN
 1   Diameter (m)
 2             14
 3             16
 4             27
 5             86
 6             19
 7             23
 8              7
 9              2
 10            63
 11           246
 12           189
 13            27
 14            19
 15            52
 16            20
 17             6
 18            44
 19             9
 20            29
 21            36
 22           102
 23            25
 24            32
 25            25
 26           188
 27            87
 28            20
 29            86
 30           447
 31            21
 32            15
 33            66
 34          2304
 35            39
 36            52
 37            63
 38            30
 39             4
 40            38
 41            16
 42           NaN  ,
     0                              1
 0 NaN  Cosmic Rays in the Atmosphere,
     0                    1
 0 NaN  Essential web links,
     0                                     1
 0 NaN  NOAA Space Weather Prediction Center,
     0                                                  1
 0 NaN  The official U.S. government space weather bureau,
     0                   1
 0 NaN  Atmospheric Optics,
     0                                                  1
 0 NaN  The first place to look for information about ...,
     0                           1
 0 NaN  Solar Dynamics Observatory,
     0                                                  1
 0 NaN  Researchers call it a "Hubble for the sun." SD...,
     0       1
 0 NaN  STEREO,
     0                                                  1
 0 NaN  3D views of the sun from NASA's Solar and Terr...,
     0                                   1
 0 NaN  Solar and Heliospheric Observatory,
     0                                                  1
 0 NaN  Realtime and archival images of the Sun from S...,
     0                 1
 0 NaN  SolarMonitor.org,
     0                                                  1
 0 NaN  information about sunspots based on the latest...,
     0                              1
 0 NaN  Starlink Satellite Statistics,
     0                                                  1
 0 NaN  current counts of failed and deployed Starlink...,
     0                          1
 0 NaN  The Aerospace Corporation,
     0                                                  1
 0 NaN  Authoritative predictions of space junk and sa...,
     0                        1
 0 NaN  Daily Sunspot Summaries,
     0                                       1
 0 NaN  from the NOAA Space Environment Center,
     0                                    1
 0 NaN  NOAA 27-Day Space Weather Forecasts,
     0                                                  1
 0 NaN  fun to read, but should be taken with a grain ...,
     0                       1
 0 NaN  Aurora 30 min forecast,
     0                                       1
 0 NaN  from the NOAA Space Environment Center,
     0                   1
 0 NaN  Live Aurora Webcam,
     0                         1
 0 NaN  from Lights over Lapland,
     0             1
 0 NaN  Heliophysics,
     0                                        1
 0 NaN  the underlying science of space weather,
     0                                                  1
 0 NaN  Spaceweather.com welcomes these supporters of ...,
     0                                                  1
 0 NaN  To get the best views of the cosmos, check out...,
     0                                                  1
 0 NaN  Got a chipped or cracked windshield that preve...,
     0                                   1
 0 NaN  NASA Near Earth Asteroid Home Page,
     0                                                  1
 0 NaN  Marketing yourself on YouTube is hard without ...,
     0                                                  1
 0 NaN  When looking for casinos to play online when t...,
     0                                                  1
 0 NaN  BestCSGOGambling is the best site for everythi...,
     0                                                  1
 0 NaN  Find the best online casinos in India at AllCa...,
     0                   1
 0 NaN  Chicago SEO Expert,
     0                                                  1
 0 NaN  Search Kelowna Real Estate Listings & Homes fo...,
     0                                                  1
 0 NaN  Would you like to bet at sites not using GamSt...,
     0                                                  1
 0 NaN  These links help Spaceweather.com stay online....,
     0              1
 0 NaN  more links...,
     0   1
 0 NaN NaN,
     0   1
 0 NaN NaN,
                                                    0
 0  HEY! SOMEBODY'S GOTTA PAY THE SERVER BILLS... ...,
                                                    0
 0  Morocco Tours: Unleash your inner adventurer! ...]

In [34]:
len(wd)

61

In [35]:
wd[0]

,0,1
0,NaN,All Sky Fireball Network
1,NaN,NaN
2,NaN,Cosmic Rays in the Atmosphere
3,Solar wind speed: 358.5 km/sec density: 1.81...,NaN

In [36]:
wd[1]

    0   1   2   3   4
0 NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN

In [46]:
import numpy as n
x16=n.random.randint(1,10,5)

In [47]:
x16

array([4, 3, 9, 6, 6])

In [48]:
n.sum(x16)

28

In [49]:
n.sqrt(x16)

array([2.        , 1.73205081, 3.        , 2.44948974, 2.44948974])

In [50]:
n.shape(x16)

(5,)

In [51]:
x12=n.random.randint(1,10,5)

In [52]:
x12

array([3, 2, 2, 7, 9])

In [53]:
x12.sort()

In [54]:
x12

array([2, 2, 3, 7, 9])

In [55]:
n.max(x12)

9

In [56]:
n.min(x12)

2

In [57]:
x12.argmin()

0

In [58]:
x12.argmax()

4

In [59]:
n.unique(x12)

array([2, 3, 7, 9])

In [64]:
print(x12)

[2 2 3 7 9]

In [66]:
n.log(x16)

array([1.38629436, 1.09861229, 2.19722458, 1.79175947, 1.79175947])

In [67]:
n.sin(x16)

array([-0.7568025 ,  0.14112001,  0.41211849, -0.2794155 , -0.2794155 ])

In [68]:
n.cos(x16)

array([-0.65364362, -0.9899925 , -0.91113026,  0.96017029,  0.96017029])

In [69]:
n.tan(16)

0.3006322420239034

In [71]:
import numpy as n

In [73]:
x1=n.array([1,2])
print(x1)

[1 2]

In [75]:
x1.size

2

In [76]:
x1.dtype

dtype('int64')

In [79]:
x2=n.arange(1,5)
print(x2)

[1 2 3 4]

In [101]:
x3=n.arange(1,10,2)
print(x3)

[1 3 5 7 9]

In [88]:
x4=n.linspace(0,5,10)
print(x4)

[0.         0.55555556 1.11111111 1.66666667 2.22222222 2.77777778
 3.33333333 3.88888889 4.44444444 5.        ]

In [92]:
x5=n.zeros(5)
print(x5)

[0. 0. 0. 0. 0.]

In [95]:
x6=n.zeros((5,6))
print(x6)

[[0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]]

In [96]:
x7=n.ones(3)
print(x7)

[1. 1. 1.]

In [97]:
x8=n.ones((3,5))
print(x8)

[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]

In [98]:
x9=n.random.randint(1,10)
print(x9)

7

In [99]:
x10=n.random.randint(1,10,5)
print(x10)

[8 8 2 2 7]

In [100]:
x11=n.linspace(0,50,10)
print(x11)

[ 0.          5.55555556 11.11111111 16.66666667 22.22222222 27.77777778
 33.33333333 38.88888889 44.44444444 50.        ]